Осуществим подключение к бд

In [1]:
%load_ext sql
%sql sqlite:///lab_2.db

'Connected: None@lab_2.db'

In [7]:
Создадим таблицу студентов, групп, городов и факультетов

SyntaxError: invalid syntax (<ipython-input-7-971cfbb64dac>, line 1)

In [2]:
%%sql 
drop table if exists Students;

CREATE TABLE Students 
(
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50), 
    Faculty_id integer,
    city_id integer,
    group_id integer
    GPA number
);

drop table if exists Faculties;
CREATE TABLE Faculties
(
id integer primary key,
name varchar(50)
);

drop table if exists Groups; 
Create table Groups
(
id integer primary key,
name varchar(50)
);

drop table if exists Cities; 
Create table Cities
(
id integer primary key,
name varchar(50)
);

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

## Задание 1 
Перепишите создание таблиц с учетом наличия внешних ключей

In [5]:
%%sql
drop table if exists Students;
drop table if exists Faculties;
drop table if exists Groups;
drop table if exists Cities;

CREATE TABLE Faculties (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(50)
);


CREATE TABLE Groups (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(50)
);

CREATE TABLE Cities (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(50)
);

CREATE TABLE Students (
    student_id integer,
    Name varchar(50),
    SecondName varchar(50), 
    Faculty_id integer,
    city_id integer,
    group_id integer,
    GPA number,
    FOREIGN KEY (Faculty_id) REFERENCES Faculties(id),
    FOREIGN KEY (city_id) REFERENCES Cities(id),
    FOREIGN KEY (group_id) REFERENCES Groups(id)
);

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

## Задание 2
Осуществить вставку во все таблицы с учетом правил на внешние ключи

In [6]:
%%sql
PRAGMA foreign_keys = ON;

Done.

[]

In [7]:
%%sql 
INSERT INTO 'Faculties' ('id', 'name') VALUES
(1, 'KIB'),
(2, 'IT');

INSERT INTO 'Groups' ('id', 'name') VALUES
(1, '101'),
(2, '103');

INSERT INTO 'Cities' ('id', 'name') VALUES
(1, 'Moscow'),
(2, 'Voroneshz');

INSERT INTO 'Students' ('student_id', 'Name', 'SecondName', 'Faculty_id', 'city_id', 'group_id', 'GPA') VALUES
(1, 'Adam', 'Volkov', 1, 1, 1, 4.5),
(2, 'Andy', 'Lazukov', 1, 1, 1, 4.8),
(3, 'Joe', 'Kazello', 2, 2, 2, 3.6),
(4, 'Sandy', 'Mayer', 2, 1, 2, 4.2);

2 rows affected.
2 rows affected.
2 rows affected.
4 rows affected.

[]

## Задание 3
Вывести Имя Студента, Название его факультета, группы и города проживания

In [7]:
%%sql
select s.Name as Name, f.name as Faculty, g.name as Group1, c.name as City
from Students s, Faculties f, Groups g, Cities c
where s.Faculty_id = f.id
and s.city_id = c.id
and s.group_id = g.id;

Done.

[('Adam', 'KIB', '101', 'Moscow'),
 ('Andy', 'KIB', '101', 'Moscow'),
 ('Joe', 'IT', '103', 'Voroneshz'),
 ('Sandy', 'IT', '103', 'Moscow')]

## Задание 4
Вывести имена всех студентов, обучающихся на факультет IT из Воронежа.

In [8]:
%%sql
select distinct s.Name as Name
from Students s
inner join Faculties f
on s.faculty_id = f.id
inner join Cities c
on s.city_id = c.id
where (c.name = 'Voroneshz') and (f.name = 'IT');

Done.

[('Joe',)]

## Задание 5
Для всевозможных пар (Факультет, Город) вывести количество студентов, соответствующее данной группе

In [9]:
%%sql 
SELECT Faculties.name AS 'Faculty', Cities.name AS 'City', COUNT(Students.name) AS 'Amount of students' 
FROM Faculties, Cities 
LEFT JOIN Students 
ON Faculties.id = Students.faculty_id AND Cities.id = Students.city_id
GROUP BY Faculties.name, Cities.name;

Done.

[('IT', 'Moscow', 1),
 ('IT', 'Voroneshz', 1),
 ('KIB', 'Moscow', 2),
 ('KIB', 'Voroneshz', 0)]

## Задание 6 
Для всех групп вывести средний балл по группе для студентов, не проживающих в Москве, при условии, что количество таких студентов не менее 3

In [10]:
%%sql 
SELECT Groups.name AS 'Group', AVG(Students.gpa) AS 'Mean GPA' 
FROM Groups 
INNER JOIN Students 
ON Students.group_id = Groups.id 
INNER JOIN Cities 
ON Students.city_id = Cities.id
WHERE Students.city_id <> (SELECT id FROM Cities WHERE name = 'Moscow') 
GROUP BY Groups.name 
HAVING COUNT(Students.student_id) >= 3;

Done.

[]

Done.

[('Joe',)]